Revit 2027 API
RebarHandlesData Class
 This class is used to contain the information about the rebar handles defined by an external application.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandlesData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarHandlesData : IDisposable
Public Class RebarHandlesData
	Implements IDisposable
public ref class RebarHandlesData : IDisposable
type RebarHandlesData =
    class
        interface IDisposable
    end
The RebarHandlesData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddCustomHandle |  Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.
Dispose | Releases all resources used by the RebarHandlesData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCustomHandles |  Gets the handle definitions for the rebar that were added.
GetEndHandle |  Gets the end handle tag.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRebarElement |  Gets the rebar element that will be updated by the server.
GetStartHandle |  Gets the start handle tag.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEndHandle |  Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.
SetStartHandle |  Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 All handle tags (custom, start, end) should have different values.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace